from sys import stdin

T = int(stdin.readline())

for t in range(T):
  m, n, x, y = map(int, stdin.readline().split())

  a = x
  b = y
  check = True
  while a<=m*n or b<=m*n:
    if a==b:
      print(a)
      check = False
      break
    if a<b:
      a=a+m
    if a>b:
      b=b+n
  if check:
    print(-1)

'''
<x, y> 말고 x만 알맞은 값이 나오려면 몇 번째 해가 되어야 하는가?

8 5 4 3


1 2 3 4 5 6 7 8 1 2 3 4 5 6 7 8 1 2 3 4 5 6 7 8 1 2 3 4 5 6 7 8 1 2 3 4 5 6 7 8
1 2 3 4 5 1 2 3 4 5 1 2 3 4 5 1 2 3 4 5 1 2 3 4 5 1 2 3 4 5 1 2 3 4 5 1 2 3 4 5

4 12 20 28 ...
3 8 13 18 23 28 ...

x + m ...
y + n ...

15
40000 39999 39999 39998
40000 39999 40000 39999
40000 40000 40000 39999
40000 39998 40000 39997
39999 2 39998 2
3 40000 3 39999
40000 3 40000 3
8 2 4 2
10 12 2 12
12 10 12 10
12 10 1 1
12 6 12 6
10 1 5 1
1 10 1 5
1 1 1 1

답:
1599959999
1599960000
-1
-1
39998
39999
120000
4
12
60
1
12
5
5
1
'''